src/Documents/НачисленияКредитовИДепозитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачисленияКредитовИДепозитов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрочиеДоходы</xr:Item>
				<xr:Item>InformationRegister.ИсправленияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>InformationRegister.СуммыДокументовВВалютахУчета</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииПрочихРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПрочаяВыручка</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныеСредстваДоходыРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ВыручкаИСебестоимостьПродаж</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоФинансовымИнструментам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправляемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСуммыГрафика</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСуммГрафикаКредитовИДепозитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаДоходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаСчетовУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonForms/ДокументыПоДоговору/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючНазначенияИспользования") 
		И ЗначениеЗаполнено(Параметры.КлючНазначенияИспользования) Тогда
		КлючНазначенияИспользования = Параметры.КлючНазначенияИспользования;
	ИначеЕсли Параметры.Свойство("КлючНазначенияФормы")
		И Не ПустаяСтрока(Параметры.КлючНазначенияФормы) Тогда
		КлючНазначенияИспользования = Параметры.КлючНазначенияФормы;
	Иначе
		КлючНазначенияИспользования = КлючНазначенияФормыПоУмолчанию();
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Договор) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		
		СвойстваСписка.ТекстЗапроса = СтрЗаменить(СписокДокументов.ТекстЗапроса, "ВЫБРАТЬ NULL КАК Ссылка", ТекстЗапросаДокументыДоговоровКредитовДепозитов());
		СвойстваСписка.ОсновнаяТаблица = СписокДокументов.ОсновнаяТаблица;
		СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
		
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументов, СвойстваСписка);
		
	ИначеЕсли ТипЗнч(Параметры.Договор) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")
		Или ТипЗнч(Параметры.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		
		СвойстваСписка.ТекстЗапроса = СтрЗаменить(СписокДокументов.ТекстЗапроса, "ВЫБРАТЬ NULL КАК Ссылка", ТекстЗапросаДокументыДоговоровКонтрагентов());
		СвойстваСписка.ОсновнаяТаблица = СписокДокументов.ОсновнаяТаблица;
		СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
		
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументов, СвойстваСписка);
		
	ИначеЕсли ТипЗнч(Параметры.Договор) = Тип("СправочникСсылка.ДоговорыЭквайринга") Тогда
		
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		
		СвойстваСписка.ТекстЗапроса = СтрЗаменить(СписокДокументов.ТекстЗапроса, "ВЫБРАТЬ NULL КАК Ссылка", ТекстЗапросаДокументыДоговоровЭквайринга());
		СвойстваСписка.ОсновнаяТаблица = СписокДокументов.ОсновнаяТаблица;
		СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
		
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументов, СвойстваСписка);
	КонецЕсли;
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Договор", Параметры.Договор);
	
	//++ Локализация
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереСписокДокументов(СписокДокументов);
	
	Если ПроверкаКонтрагентовВызовСервера.ИспользованиеПроверкиВозможно() Тогда
		Элементы.СписокДокументовЕстьОшибкиПроверкиКонтрагентов.Видимость = Истина;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	//-- Локализация
	
	ТипДоговора = ТипЗнч(Параметры.Договор);
	ТипыДокументовПоДоговору = Новый Массив;
	
	ТипыДокументов = СписокДокументов.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	Для каждого ТипДокумента Из ТипыДокументов.Типы() Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
		РеквизитДоговор = МетаданныеДокумента.Реквизиты.Найти("Договор");
		Если РеквизитДоговор <> Неопределено И РеквизитДоговор.Тип.СодержитТип(ТипДоговора) Тогда
			ТипыДокументовПоДоговору.Добавить(ТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.НачисленияКредитовИДепозитов"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"));
	ТипыДокументовПоДоговору.Добавить(Тип("ДокументСсылка.ОтчетБанкаПоОперациямЭквайринга"));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ТипыДокументовПоДоговору.Количество() Тогда
		ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
		ПараметрыРазмещения.Источники = Новый ОписаниеТипов(ТипыДокументовПоДоговору);
		ПараметрыРазмещения.КоманднаяПанель = Элементы.СписокДокументовКоманднаяПанель;
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодДатаНачалаДатаОкончанияПриИзменении(Элемент)
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументов

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	ОбщегоНазначенияУтКлиент.РедактироватьПериод(Период,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.СписокДокументов);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.СписокДокументов, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокДокументов);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "СписокДокументов.Дата", "СписокДокументовДата");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериоду()
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючНазначенияФормыПоУмолчанию()
	
	Возврат "ДокументыПоДоговору";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДокументыДоговоровКредитовДепозитов()
	
	ТекстЗапроса = "
	|	ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		РегистрСведений.РеестрДокументов КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Договор = &Договор
	|		И НЕ ДанныеДокумента.ДополнительнаяЗапись
	|";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ДоговорКредитаДепозита = &Договор)
		|";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходныйКассовыйОрдер) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ДоговорКредитаДепозита = &Договор)
		|";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ДоговорКредитаДепозита = &Договор)
		|";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходныйКассовыйОрдер) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ДоговорКредитаДепозита = &Договор)
		|";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ДоговорКредитаДепозита = &Договор)
		|";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.НачисленияКредитовИДепозитов) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.НачисленияКредитовИДепозитов КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.НачисленияКредитовИДепозитов.Начисления КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.Договор = &Договор)
		|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции



&НаСервере
Функция ТекстЗапросаДокументыДоговоровКонтрагентов()
	
	ТекстЗапроса = "
	|	ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		РегистрСведений.РеестрДокументов КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Договор = &Договор
	|		И НЕ ДанныеДокумента.ДополнительнаяЗапись
	|";
	
	ТекстыЗапросовРасшифровки = Новый Массив;	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
				
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.РасходныйКассовыйОрдер) Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПриходныйКассовыйОрдер) Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств) Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ
		|				ДанныеТабличнойЧасти.Ссылка
		|			ИЗ
		|				Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|			ГДЕ
		|				ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|				И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);
		
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ОперацияПоПлатежнойКарте) Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = "
		|ВЫБРАТЬ
		|		ДанныеДокумента.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ОперацияПоПлатежнойКарте КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Объект = &Договор
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ДанныеТабличнойЧасти.Ссылка
		|				ИЗ
		|					Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
		|				ГДЕ
		|					ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
		|					И ДанныеТабличнойЧасти.ОбъектРасчетов.Договор = &Договор)
		|";
		ТекстыЗапросовРасшифровки.Добавить(ТекстЗапросаРасшифровкиПлатежа);

	КонецЕсли;
	
	Если ТекстыЗапросовРасшифровки.Количество() Тогда
		
		ТекстЗапросаРасшифровкиПлатежа = СтрСоединить(ТекстыЗапросовРасшифровки, "ОБЪЕДИНИТЬ ВСЕ"); //@Query-part
		
		// ОБЪЕДИНИТЬ, потому что Ссылки из расшифровок платежа могут дублировать Ссылки из реестра.
		ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ " + "
		|ВЫБРАТЬ
		|		ДанныеРасшифровкиПлатежа.Ссылка КАК Ссылка
		|	ИЗ
		|	(" //@query-part
		+ ТекстЗапросаРасшифровкиПлатежа + ") КАК ДанныеРасшифровкиПлатежа 
		|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ТекстЗапросаДокументыДоговоровЭквайринга()
	
	ТекстЗапроса = "
	|	ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка
	|	ИЗ
	|		РегистрСведений.РеестрДокументов КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Договор = &Договор
	|		И НЕ ДанныеДокумента.ДополнительнаяЗапись
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
